In [17]:
import pandas as pd

In [18]:
# 2 Main DataTypes

# Series

In [19]:
# Series = 1-dimensional

In [20]:
series = pd.Series(["BMW", "Tesla","Nissan"])

In [21]:
series #

0       BMW
1     Tesla
2    Nissan
dtype: object

In [22]:
colours = pd.Series(["Red","Green","Yellow"])
colours

0       Red
1     Green
2    Yellow
dtype: object

# DataFrames

In [23]:
# DataFrames = 2-dimensional

In [24]:
car_data = pd.DataFrame({"Car Brand":series,"Colour":colours})
car_data

  Car Brand  Colour
0       BMW     Red
1     Tesla   Green
2    Nissan  Yellow

In [25]:
#Import Data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [26]:
# Exporting DataFrames

#car_sales.to_csv("Exported_Car_Sales.csv")

In [30]:
Imported_car_sales = pd.read_csv("car-sales.csv")
Imported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describing Data

In [31]:
#Attribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [32]:
#Function
#car_sales.to_csv()

In [33]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [34]:
car_columns = car_sales.columns # show the first row (name of every column)
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [35]:
car_sales.index # describes the index

RangeIndex(start=0, stop=10, step=1)

In [37]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [38]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [39]:
car_prices = pd.Series([1000,52000,1500,6900])
car_prices

0     1000
1    52000
2     1500
3     6900
dtype: int64

In [41]:
car_prices.mean()

15350.0

In [42]:
car_prices.sum()

61400

In [43]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [44]:
car_sales["Doors"].sum()

40

In [46]:
len(car_sales) #how many rows

10